test/performance/benchmarks/real-traffic-test/results/kube-manager/10_seconds-10_interfering/2026-02-23_21-11-20/vegeta_metrics.txt
=== Real Traffic Test Results ===


== Test Configuration ==

Services: 10
RPS: 50
Duration: 1m0s
Min Latency: 0s
Max Latency: 0s
Min Startup Latency: 0s
Max Startup Latency: 0s
Min Payload Size (bytes): 10000
Max Payload Size (bytes): 10000
Critical Test: false
Sources of Interference: 10
Interfering Namespace: interference
Bucket Node: dessertw3


== Test Results ==

= Aggregated Results =

Requests      [total, rate, throughput]         3000, 50.02, 50.01
Duration      [total, attack, wait]             59.987s, 59.981s, 6.125ms
Latencies     [min, mean, 50, 90, 95, 99, max]  4.857ms, 99.777ms, 6.314ms, 9.495ms, 283.259ms, 2.802s, 4.204s
Bytes In      [total, mean]                     29135142, 9711.71
Bytes Out     [total, mean]                     30000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:3000  
Error Set:

= Per-Service Results =

# Service: perftest-0

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.8s, 5.529ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.173ms, 57.321ms, 6.242ms, 9.3ms, 16.566ms, 1.868s, 2.34s
Bytes In      [total, mean]                     2910655, 9702.18
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-1

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.801s, 5.56ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.244ms, 50.655ms, 6.386ms, 9.616ms, 17.875ms, 1.69s, 2.203s
Bytes In      [total, mean]                     2913630, 9712.10
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-2

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.805s, 59.8s, 5.429ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.178ms, 53.483ms, 6.378ms, 9.471ms, 16.06ms, 1.798s, 2.231s
Bytes In      [total, mean]                     2914255, 9714.18
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-3

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.812s, 59.8s, 12.605ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.214ms, 101.204ms, 6.543ms, 10.615ms, 376.054ms, 2.77s, 3.234s
Bytes In      [total, mean]                     2911086, 9703.62
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-4

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.807s, 59.8s, 7.217ms
Latencies     [min, mean, 50, 90, 95, 99, max]  4.979ms, 119.62ms, 6.204ms, 8.999ms, 698.56ms, 3.075s, 3.567s
Bytes In      [total, mean]                     2914558, 9715.19
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-5

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.807s, 59.799s, 7.023ms
Latencies     [min, mean, 50, 90, 95, 99, max]  4.902ms, 94.181ms, 6.158ms, 8.697ms, 264.783ms, 2.651s, 3.11s
Bytes In      [total, mean]                     2914485, 9714.95
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-6

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.807s, 59.8s, 7.175ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.115ms, 96.427ms, 6.48ms, 10.314ms, 287.201ms, 2.674s, 3.195s
Bytes In      [total, mean]                     2913882, 9712.94
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-7

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.807s, 59.801s, 6.391ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.214ms, 102.965ms, 6.514ms, 9.412ms, 398.197ms, 2.802s, 3.286s
Bytes In      [total, mean]                     2914261, 9714.20
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-8

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.805s, 59.8s, 5.037ms
Latencies     [min, mean, 50, 90, 95, 99, max]  4.987ms, 158.279ms, 6.112ms, 9.523ms, 1.281s, 3.678s, 4.129s
Bytes In      [total, mean]                     2913511, 9711.70
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-9

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.8s, 6.125ms
Latencies     [min, mean, 50, 90, 95, 99, max]  4.857ms, 163.634ms, 6.096ms, 9.363ms, 1.353s, 3.77s, 4.204s
Bytes In      [total, mean]                     2914819, 9716.06
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set: